{
  "toolName": "timeService",
  "description": "Utility for time operations with two modes: (1) Timestamp Mode — return a concrete time after applying offsets to the current time in the given timezone; (2) Difference Mode — return the time difference between a start time and a target time, formatted as a time string. Default timezone is UTC+8. Leap day (Feb 29) is handled. IMPORTANT: Only provide 'baseTime' and/or 'targetTime' when computing a difference. For simple timestamp retrieval, omit both fields. Offsets (Y/M/D/h/m/s) are always applied to the start time only, never to 'targetTime'.",
  "input": {
    "timezone": "Integer, optional. Default = 8. Range [-12, 14]. Hours offset from UTC (e.g., 8 means UTC+8). Used to interpret now(), and (if provided) baseTime/targetTime, and to format the final result.",
    "Y": "Integer, optional. Year offset (positive or negative). Offsets are applied in the order Y → M → D → h → m → s to the start time.",
    "M": "Integer, optional. Month offset (positive or negative). Rolls across years as needed.",
    "D": "Integer, optional. Day offset (positive or negative). Must respect month length and leap years.",
    "h": "Integer, optional. Hour offset (positive or negative).",
    "m": "Integer, optional. Minute offset (positive or negative).",
    "s": "Integer, optional. Second offset (positive or negative).",
    "baseTime": "String, optional. Format: 'YYYY-MM-DD hh:mm:ss' (24-hour). Use ONLY in Difference Mode. Defines the start time BEFORE offsets are applied. If provided without targetTime, this is invalid and MUST return error code 'IGNORED_BASE_ONLY'. Do NOT provide this when only retrieving a timestamp.",
    "targetTime": "String, optional. Format: 'YYYY-MM-DD hh:mm:ss' (24-hour). Use ONLY in Difference Mode. Defines the comparison time. If provided alone, the start time is taken as now() (in 'timezone') with offsets applied; diff = targetTime − start. If provided with baseTime, diff = targetTime − (baseTime with offsets applied). Do NOT provide this when only retrieving a timestamp."
  },
  "output": {
    "success": "Boolean. true on success; false on failure.",
    "result": "String. Always returned in time format. In Timestamp Mode: 'YYYY-MM-DD hh:mm:ss (UTC+X)'. In Difference Mode: the calculated difference expressed as a formatted time string 'YYYY-MM-DD hh:mm:ss'.",
    "resultType": "String. Always 'time'.",
    "error": "String. Present only when success=false. SHOULD include a stable error code such as 'IGNORED_BASE_ONLY', 'INVALID_TIME_FORMAT', 'OUT_OF_RANGE_TIMEZONE', or 'INVALID_OFFSET_TYPE', optionally followed by a short message.",
    "value": "Any, optional. Additional diagnostics when success=false (e.g., parsed inputs)."
  }
}
