{"timestamp": 1758437877.7060108, "content": {"success": true, "result": {"source_url": "https://tech4gamers.com/nvidia-blackwell-featuring-5x-ai-performance-in-comparison-with-hopper/", "article_text": "Expert Verified By\n5x AI Performance In Comparison With Current Solution While Consuming Same Power!\nAs Tech4Gamers’ Founder and Editor-in-Chief, I bring over 13 years of PC Hardware Reviewing and 8+ years of IT Project Management experience. Certified inGoogle IT Support, my focus is on providing honest product reviews and analysis and fostering a strong gaming community with 130k+ members in PPG.\nNVIDIA announced during the GTC its new top-of-the-range graphics chip aimed at Artificial Intelligence; we are talking aboutBlackwell.\nThis is not only the largest graphics chip in the world, but it manages to increase the performance of what until now was the most powerful GPU in the world, Hopper (NVIDIA H100), by five.\nThe NVIDIA Blackwell GPU is also the first multi-chip design (MCM) graphics chip created by NVIDIA. Each Blackwell chip is linked to two Blackwell GPUs. Now, the platform used to bring it to life combines two complete Blackwell chips and an Arm Grace CPU. Let’s look at what NVIDIA Blackwell offers to the industry.\nThe NVIDIA Blackwell GPU is made up of 208 billion transistors. These are 128,000 million more compared to the NVIDIA Hopper chip. This chip also incorporates four times more memory integrated into the die itself, which translates into offering up to192 GB of HBM3e memory, which, together with an 8,192-bit interface, provides abandwidth of 8 TB/s.\nThis chip is manufactured by TSMC using its4nm 4NP lithography, while each GPU that makes up the Blackwell chip is interconnected through an interface with a bandwidth of 10 TB/s.\nNVIDIA Blackwell comprises 20,480 CUDA Cores, uses 8-layer HBM3e memory chips, and can reach aTDPof up to 700W. This TDP is the same as found in the NVIDIA H100 and H200 GPUs.\nNVIDIA Blackwell can deliver AI performance of 20 petaFLOPS, 5 times faster than the NVIDIA H100 chip. The top-of-the-range Hopper chip is aimed at AI-related workloads. As we said, two of these complete chips are accompanied by a Grace CPU to create the NVIDIA HB200 superchip.\nThis Superchip has a CPU with 72 Arm Neoverse V2 cores, two Blackwell GPUs, access to 384 GB of HBM3e memory, and an NVLink-C2C interconnect with a bandwidth of 900 GB/s.\nBelow, you can find the performance numbers of the NVIDIA Blackwell chip compared to the NVIDIA Hopper:\nThanks to these improvements, NVIDIA is confident that Blackwell is themost powerful AI chip in the world. This architecture uses the 2nd Generation Transformer Engine.\nThese feature new microtensor scaling support and NVIDIA’s advanced dynamic range management algorithms built into the NVIDIA TensorRT™-LLM and NeMo Megatron frameworks.\nThis means Blackwell will support double the compute and model sizes with new 4-bit floating point AI inference capabilities. With the 5th Generation of the NVIDIA NVLink interconnect, a bidirectional performance of 1.8 TB/s per GPU is achieved. This ensures seamless high-speed communication between up to 576 GPUs for the most complex LLMs.\nLatest Updates\nNVIDIA Blackwell GPUs feature AI preventive maintenance. This guarantees reliability, availability, and ease of maintenance. This AI runs diagnostics and helps you predict reliability issues. This maximizes system uptime and improves resiliency so large-scale AI deployments run uninterrupted for weeks or even months. This translates into reducing operating costs.\nThere is no official information on the release date of the NVIDIA Blackwell. However, based on rumors and speculation, they are expected to be launched sometime in late 2024 or early 2025.\nWhat are your thoughts on this new powerful chip for Nvidia aiming towards the new revolution of AI? Share your thoughts in the comment section below.\nThank you! Please share your positive feedback. 🔋\nHow could we improve this post? Please Help us. 😔\nCheck your inbox or spam folder to confirm your subscription.\n[Editor-in-Chief]\nSajjad Hussain is the Founder and Editor-in-Chief of Tech4Gamers.com. Apart from the Tech and Gaming scene, Sajjad is a Seasonal banker who has delivered multi-million dollar projects as an IT Project Manager and works as a freelancer to provide professional services to corporate giants and emerging startups in the IT space.\nMajored in Computer Science13+ years of Experience as a PC Hardware Reviewer.8+ years of Experience as an IT Project Manager in the Corporate Sector.Certified inGoogle IT Support Specialization.Admin of PPG, the largest local Community of gamers with 130k+ members.\nSajjad is a passionate and knowledgeable individual with many skills and experience in the tech industry and the gaming community. He is committed to providing honest, in-depth product reviews and analysis and building and maintaining a strong gaming community.\nCheck your inbox or spam folder to confirm your subscription.\nStill having issues? Join theTech4Gamers Forumfor expert help and community support!\nCheck your inbox or spam folder to confirm your subscription."}, "error": null, "resultType": "object"}}